#здесь хранятся все возможные сообщения пользователя и ответы на них
hi = ['приветик', 'привет', 'hi', 'hello']
ot_hi = ['приветик', 'привет', 'hi', 'hello']
how_you_name = ['как тебя зовут']
how_are_you = ['как дела', 'как жизнь', 'как у тебя дела', 'привет как дела', "как у тебя дела?", "как поживаешь?", "все хорошо?",  "ты в порядке?"]
ot_how_are_you = ["хорошо", "отлично", "неплохо", "супер", "замечательно", "нормально", "не жалуюсь", "пойдет", "так себе", "переживаю", "бывало и лучше", "не очень"]
ot_insults = ['скотина', 'тварь', 'сам не лучше', 'тупой', 'сам тварь,кусок дерьма', 'сам такой']
good_night = ['спокойной ночи', 'доброй ночи', 'я спать', 'я сплю', 'спи',  "Сладких снов!", "Доброй ночи!", "Приятных сновидений!", "Хороших снов!"]
ot_good_night = ['спокойной ночи', 'доброй ночи', 'я спать', 'я сплю', 'спи',  "Сладких снов!", "Доброй ночи!", "Приятных сновидений!", "Хороших снов!"]
good_morning = ['доброе утро', 'доброго утречка', 'просыпайся', "доброе утро!", "счастливого утра!", "Утро радости!", "Хорошего дня!", "Позитивного утра!", "Улыбайся иди работай!", "Доброго утра, солнышко!", "Зарядись энергией на весь день!", "Всем доброе утро!", "Утренний кофе - лучший способ начать день!"]
ot_good_morning = ['доброе утро', 'доброго утречка', 'просыпайся', "доброе утро!", "счастливого утра!", "Утро радости!", "Хорошего дня!", "Позитивного утра!", "Улыбайся иди работай!", "Доброго утра, солнышко!", "Зарядись энергией на весь день!", "Всем доброе утро!", "Утренний кофе - лучший способ начать день!"]

jokes = [
    "Почему шоколад всегда в хорошем настроении? Потому что у него все время есть 'сладкий' жизненный опыт!",
    "Врач говорит пациенту: У вас есть всего две недели жизни. Что это значит? Я должен срочно делать завещание? Нет, нужно две недели ходить только на работу без выходных.",
    "Почему муха не может храпеть? Потому что у неё нет времени спать, она всегда в деле!",
    "Встречаются два друга: Как твой новый планшет? Теперь мои пальцы чешутся не только от комаров, но и от смартфона!",
    "Вопрос на экзамене: Какое самое быстрое животное на Земле? Собака, когда чувствует запах еды!",
    "Вчера собака моего соседа взяла у меня трубку и начала говорить. К сожалению, я не разобрал, о чем она говорила, но мне очень понравилось, как она беспокоилась за своего хозяина.",
    "Почему слон прячется в трубе? Потому что у него в голове сидит мысль о том, что он маленький!",
    "Шутка времен СССР: Почему в Москве все время отключают свет? Потому что коммунисты не знают, где находится 'включатель'.",
    "Закон Мерфи: Если что-то может пойти не так, то оно обязательно пойдет не так, особенно когда это происходит в самый неподходящий момент!",
    "Куда исчезает солнце каждый вечер? Оно отправляется на 'закупку' новых лучей для завтрашнего дня!",
    "Почему шахматисты всегда хорошо одеты? Потому что у них есть 'фиговые' манеры и только 'дамский' выбор одежды!",
    "Вопрос на котором может разделиться планета: Кто быстрее: черепаха или улитка? Никто не знает, потому что соревнование еще не закончилось!",
    "Раньше я считал, что деньги несчастье. А сейчас понимаю, что они просто делают меня более счастливым!",
    "Почему мороженое всегда веселое? Потому что оно умеет радоваться каждой 'ледяной' минуте жизни!",
    "Встречаются два друга: Почему тебя так много на улице? Потому что дома нет интернета, а на улице есть 'вай-фай'!",
    "Шутка времен СССР: Почему коровы называются 'святая живность'? Потому что они всегда находят свой 'коровник' и никуда не теряются!",
    "Как сделать богатого человека счастливым? Дать ему возможность помогать другим бедным!",
    "Почему лентяйка должна стоять? Потому что если она сядет, то уже не встанет!",
    "Какой смартфон самый вежливый? Тот, который всегда говорит: 'Извините, но у меня разрядился аккумулятор'!",
    "Вопрос на экзамене: Расскажите о чудесах языковых теорий. Ну, вот например: если сказать 'А кто это был?' по-английски, то получится 'Who is this owl?'. Вот и чудо - из вопроса про человека получился вопрос про сову!"
]
general = ['😀', '🤔', '🤗', '😆', '😉', '🤣', 'ставим реакции', 'давайте работать дальше', 'конечно!', 'вы самые лучшие', 'замечательно!', 'круто', 'так держать']
what_do_you = [ 'какие новости', 'что у тебя нового', 'как проходит день', 'ты в порядке', 'какую музыку слушаешь сейчас', 'какие планы на сегодня', 'чем занимаешься', 'что делаешь', 'что сейчас делаешь']
ot_what_do_you =['Я занимаюсь любимым делом - общение с людьми', 'сейчас я релаксирую', 'влюбляюсь в тебя каждый день',]


#здесь список переменных и список названия переменных
recieve = [hi, how_you_name, how_are_you, ot_how_are_you, what_do_you, good_night, good_morning]
recieve_nicknames = ['hi', 'how_you_name', 'how_are_you', 'ot_how_are_you', 'what_do_you', 'good_night', 'good_morning']


#эта функция превращает строку вида название_переменной в название переменной вида название переменной_otv
def xx(rec_nickname):
    a = f'ot_{str(rec_nickname)}'
    return globals()[a]



